{
  "categories": [
    {
      "id": "ui-components",
      "name": "UI Components",
      "description": "Modern web uygulamaları için temel kullanıcı arayüzü bileşenleri ve widget'ları içeren kapsamlı koleksiyon. Bu kategori, geliştiricilerin hızlı ve etkili bir şekilde profesyonel kullanıcı arayüzleri oluşturmasını sağlayan hazır bileşenleri barındırır.",
      "subcategories": [
        {
          "id": "data-grid",
          "name": "Data Grid & Table",
          "description": "Büyük veri setlerini etkili şekilde görüntülemek ve yönetmek için gelişmiş tablo ve grid bileşenleri. Kullanıcıların verileri sıralaması, filtrelemesi ve analiz etmesi için güçlü araçlar sunar.",
          "libraries": [
            {
              "name": "AG Grid",
              "description": "Javascript, React, AngularJS ve Web Components için gelişmiş veri tablosu ve grid bileşeni. Kurumsal seviyede özellikler sunar ve büyük veri setlerini yüksek performansla işler. Sıralama, filtreleme, gruplama ve daha birçok gelişmiş özellik içerir.",
              "github": "https://github.com/ag-grid/ag-grid",
              "demo": "https://www.ag-grid.com/",
              "docs": "https://www.ag-grid.com/",
              "npm": "ag-grid-react",
              "tags": ["table", "grid", "enterprise", "sorting", "filtering"]
            },
            {
              "name": "TanStack Table",
              "description": "Güçlü tablolar ve veri grid'leri oluşturmak için headless UI yaklaşımı. Tamamen özelleştirilebilir ve esnek yapısı sayesinde geliştiriciler kendi tasarım sistemlerini entegre edebilir. TypeScript desteği ile tip güvenliği sağlar.",
              "github": "https://github.com/tannerlinsley/react-table",
              "demo": "https://tanstack.com/table/v8/docs/examples/react/basic",
              "docs": "https://tanstack.com/table/v8",
              "npm": "@tanstack/react-table",
              "tags": ["table", "headless", "flexible", "typescript"]
            },
            {
              "name": "MUI X Data Grid",
              "description": "Güçlü kullanıcılar için gelişmiş özelliklerle hızlı ve özelleştirilebilir veri grid'i. Material Design tabanlı tasarım sistemi ile tutarlı görünüm sağlar. Kurumsal uygulamalar için optimize edilmiş performans ve özellikler sunar.",
              "github": "https://github.com/mui/mui-x",
              "demo": "https://mui.com/x/react-data-grid/",
              "docs": "https://mui.com/x/react-data-grid/",
              "npm": "@mui/x-data-grid",
              "tags": ["table", "material-ui", "enterprise", "advanced"]
            }
          ]
        },
        {
          "id": "forms",
          "name": "Form Components",
          "description": "Kullanıcı girişlerini toplamak ve doğrulamak için modern form bileşenleri ve validasyon sistemleri. Geliştiricilerin karmaşık form yapılarını kolayca oluşturmasını ve yönetmesini sağlayan güçlü araçlar içerir.",
          "libraries": [
            {
              "name": "React Hook Form",
              "description": "Performans odaklı form validasyonu için React hooks kullanan modern form kütüphanesi. Karmaşık form yapılarını kolayca yönetin ve yüksek performans elde edin. Gereksiz re-render'ları önleyerek uygulama hızını artırır.",
              "github": "https://github.com/react-hook-form/react-hook-form",
              "demo": "https://react-hook-form.com/",
              "docs": "https://react-hook-form.com/",
              "npm": "react-hook-form",
              "tags": ["form", "validation", "hooks", "performance"]
            },
            {
              "name": "Formik",
              "description": "Gözyaşı dökmeden formlar oluşturun ve kolay validasyon desteği ile güçlü form yönetimi sağlayın. Form state'ini yönetmek için gerekli tüm araçları sunar ve geliştirici deneyimini iyileştirir.",
              "github": "https://github.com/jaredpalmer/formik",
              "demo": "https://formik.org/",
              "docs": "https://formik.org/",
              "npm": "formik",
              "tags": ["form", "validation", "field-array"]
            },
            {
              "name": "React Final Form",
              "description": "Abonelik tabanlı form durumu yönetimi ile yüksek performans ve esnek yapı sunan modern form çözümü. Gereksiz re-render'ları önleyerek uygulama performansını optimize eder ve geliştirici deneyimini iyileştirir.",
              "github": "https://github.com/final-form/react-final-form",
              "demo": "https://final-form.org/react",
              "docs": "https://final-form.org/react",
              "npm": "react-final-form",
              "tags": ["form", "subscription", "performance"]
            }
          ]
        },
        {
          "id": "navigation",
          "name": "Navigation",
          "description": "Uygulama içi sayfa geçişleri ve routing işlemleri için güçlü navigasyon bileşenleri. Kullanıcıların uygulama içinde kolayca gezinebilmesini sağlayan modern ve performanslı routing çözümleri sunar.",
          "libraries": [
            {
              "name": "React Router",
              "description": "React uygulamaları için tam özellikli routing kütüphanesi. Declarative routing yaklaşımı ile modern web uygulamaları geliştirmeyi kolaylaştırır. Nested routes, dynamic routing ve code splitting gibi gelişmiş özellikler içerir.",
              "github": "https://github.com/reactjs/react-router",
              "demo": "https://reactrouter.com/",
              "docs": "https://reactrouter.com/",
              "npm": "react-router-dom",
              "tags": ["routing", "navigation", "declarative"]
            },
            {
              "name": "Wouter",
              "description": "Minimalist dostu yaklaşım ile sadece 1.3KB boyutunda hafif routing kütüphanesi. Sadece hooks kullanarak basit ve hızlı routing çözümü sunar. Küçük projeler ve prototip geliştirme için ideal seçimdir.",
              "github": "https://github.com/molefrog/wouter",
              "demo": "https://wouter.netlify.app/",
              "docs": "https://github.com/molefrog/wouter",
              "npm": "wouter",
              "tags": ["routing", "lightweight", "hooks"]
            }
          ]
        }
      ]
    },
    {
      "id": "ui-frameworks",
      "name": "UI Frameworks",
      "description": "Hazır tasarım sistemleri ve tam özellikli kullanıcı arayüzü framework'leri ile hızlı geliştirme. Geliştiricilerin tutarlı ve profesyonel kullanıcı arayüzleri oluşturmasını sağlayan kapsamlı bileşen kütüphaneleri sunar.",
      "subcategories": [
        {
          "id": "material-design",
          "name": "Material Design",
          "description": "Google'ın Material Design prensiplerine dayalı modern ve tutarlı tasarım sistemleri. Kullanıcı deneyimini iyileştiren görsel hiyerarşi, animasyonlar ve responsive tasarım özellikleri içerir.",
          "libraries": [
            {
              "name": "Material UI (MUI)",
              "description": "Tam özellikli bileşen koleksiyonu ile kendi tasarım sisteminizi oluşturun veya Material Design ile başlayın. Kurumsal uygulamalar için optimize edilmiş performans ve özellikler sunar. Tema sistemi ile kolay özelleştirme imkanı sağlar.",
              "github": "https://github.com/mui/material-ui",
              "demo": "https://mui.com/",
              "docs": "https://mui.com/",
              "npm": "@mui/material",
              "tags": ["material-design", "components", "theme", "enterprise"]
            },
            {
              "name": "React Toolbox",
              "description": "Google'ın Material Design'ını uygulayan React bileşenleri seti. CSS modülleri ile modern yaklaşım kullanarak stil çakışmalarını önler. Hafif ve performanslı yapısı ile küçük ve orta ölçekli projeler için ideal seçimdir.",
              "github": "https://github.com/react-toolbox/react-toolbox",
              "demo": "http://react-toolbox.io/",
              "docs": "http://react-toolbox.io/",
              "npm": "react-toolbox",
              "tags": ["material-design", "css-modules"]
            }
          ]
        },
        {
          "id": "component-collections",
          "name": "Component Collections",
          "description": "Geniş kapsamlı bileşen kütüphaneleri ve hazır tasarım sistemleri. Geliştiricilerin hızlı prototip oluşturmasını ve tutarlı kullanıcı arayüzleri geliştirmesini sağlayan kapsamlı çözümler sunar.",
          "libraries": [
            {
              "name": "Ant Design",
              "description": "Çin'den gelen profesyonel UI tasarım dili. Bireysel bileşenler mevcut ve kurumsal uygulamalar için ideal seçimdir. Zengin bileşen kütüphanesi ve güçlü tasarım sistemi ile büyük ölçekli projeler için optimize edilmiştir.",
              "github": "https://github.com/ant-design/ant-design",
              "demo": "https://ant.design/",
              "docs": "https://ant.design/docs/react/introduce",
              "npm": "antd",
              "tags": ["enterprise", "components", "design-system"]
            },
            {
              "name": "Chakra UI",
              "description": "React uygulamalarınız için basit, modüler ve erişilebilir UI bileşenleri. Modern ve kullanıcı dostu tasarım yaklaşımı ile geliştirici deneyimini iyileştirir. Accessibility standartlarına uygun bileşenler sunar.",
              "github": "https://github.com/chakra-ui/chakra-ui",
              "demo": "https://chakra-ui.com/",
              "docs": "https://chakra-ui.com/",
              "npm": "@chakra-ui/react",
              "tags": ["accessible", "theme", "components"]
            },
            {
              "name": "Mantine",
              "description": "100'den fazla hook ve bileşen ile tam özellikli modern kütüphane. Yerel karanlık tema desteği ve modern tasarım yaklaşımı ile geliştirici deneyimini iyileştirir. TypeScript desteği ile tip güvenliği sağlar.",
              "github": "https://github.com/mantinedev/mantine",
              "demo": "https://mantine.dev/",
              "docs": "https://mantine.dev/",
              "npm": "@mantine/core",
              "tags": ["dark-theme", "hooks", "components", "modern"]
            }
          ]
        }
      ]
    },
    {
      "id": "ui-utilities",
      "name": "UI Utilities",
      "description": "Kullanıcı arayüzü geliştirmeyi kolaylaştıran yardımcı araçlar, hook'lar ve utility fonksiyonları. Geliştiricilerin yaygın UI işlemlerini hızlı ve etkili şekilde gerçekleştirmesini sağlayan pratik çözümler sunar.",
      "subcategories": [
        {
          "id": "hooks",
          "name": "Custom Hooks",
          "description": "Yaygın UI işlemleri için özel olarak tasarlanmış React hook'ları ve yardımcı fonksiyonlar. Geliştiricilerin tekrar eden kod yazmasını önleyerek daha temiz ve maintainable kod yazmasını sağlar.",
          "libraries": [
            {
              "name": "React Hook Form",
              "description": "Karmaşık olmadan React hooks ile form validasyonu gerçekleştirin. Yüksek performans ve esnek yapı ile modern form çözümleri sunar. Gereksiz re-render'ları önleyerek uygulama performansını optimize eder.",
              "github": "https://github.com/react-hook-form/react-hook-form",
              "demo": "https://react-hook-form.com/",
              "docs": "https://react-hook-form.com/",
              "npm": "react-hook-form",
              "tags": ["form", "validation", "hooks", "performance"]
            },
            {
              "name": "React Query",
              "description": "Güçlü asenkron durum yönetimi, sunucu durumu yardımcıları ve veri çekme işlemleri için modern çözüm. Caching, background updates ve optimistic updates gibi gelişmiş özellikler ile geliştirici deneyimini iyileştirir.",
              "github": "https://github.com/TanStack/query",
              "demo": "https://tanstack.com/query",
              "docs": "https://tanstack.com/query/latest",
              "npm": "@tanstack/react-query",
              "tags": ["data-fetching", "caching", "state-management"]
            }
          ]
        },
        {
          "id": "animations",
          "name": "Animations",
          "description": "Kullanıcı deneyimini geliştiren akıcı animasyonlar, geçişler ve hareket efektleri. Modern web uygulamalarında görsel çekiciliği artıran ve kullanıcı etkileşimini iyileştiren güçlü animasyon kütüphaneleri sunar.",
          "libraries": [
            {
              "name": "Framer Motion",
              "description": "Gelişmiş animasyon ve hareket kütüphanesi ile karmaşık animasyonları kolayca oluşturun. Gesture desteği ve spring animasyonları ile doğal ve akıcı kullanıcı deneyimi sağlar. React'in declarative yaklaşımı ile uyumlu çalışır.",
              "github": "https://github.com/framer/motion",
              "demo": "https://www.framer.com/motion/",
              "docs": "https://www.framer.com/motion/",
              "npm": "framer-motion",
              "tags": ["animation", "gestures", "spring"]
            },
            {
              "name": "React Spring",
              "description": "Fizik tabanlı yay animasyon kütüphanesi ile doğal ve akıcı hareketler oluşturun. Gerçekçi animasyonlar için ideal seçimdir ve performans odaklı yaklaşımı ile büyük uygulamalarda bile sorunsuz çalışır.",
              "github": "https://github.com/react-spring/react-spring",
              "demo": "https://react-spring.dev/",
              "docs": "https://react-spring.dev/",
              "npm": "@react-spring/web",
              "tags": ["animation", "physics", "spring"]
            }
          ]
        }
      ]
    },
    {
      "id": "state-management",
      "name": "State Management",
      "description": "React uygulamalarında veri durumunu etkili şekilde yönetmek için güçlü state management çözümleri. Uygulama genelinde veri tutarlılığını sağlayan ve geliştirici deneyimini iyileştiren modern state yönetim araçları sunar.",
      "subcategories": [
        {
          "id": "global-state",
          "name": "Global State",
          "description": "Uygulama genelinde veri durumunu yönetmek için global state management sistemleri. Bileşenler arası veri paylaşımını kolaylaştıran ve uygulama performansını optimize eden güçlü çözümler sunar.",
          "libraries": [
            {
              "name": "Redux Toolkit",
              "description": "Verimli Redux geliştirme için resmi, görüşlü ve tüm özellikleri dahil araç seti. Boilerplate kod miktarını azaltarak geliştirici deneyimini iyileştirir. Modern JavaScript özellikleri ile optimize edilmiş performans sunar.",
              "github": "https://github.com/reduxjs/redux-toolkit",
              "demo": "https://redux-toolkit.js.org/",
              "docs": "https://redux-toolkit.js.org/",
              "npm": "@reduxjs/toolkit",
              "tags": ["state-management", "redux", "toolkit"]
            },
            {
              "name": "Zustand",
              "description": "Basitleştirilmiş flux prensiplerini kullanan hızlı ve hafif durum yönetimi çözümü. Minimal API ile geliştirici deneyimini iyileştirir ve TypeScript desteği ile tip güvenliği sağlar. Küçük ve orta ölçekli projeler için ideal seçimdir.",
              "github": "https://github.com/pmndrs/zustand",
              "demo": "https://zustand.surge.sh/",
              "docs": "https://github.com/pmndrs/zustand",
              "npm": "zustand",
              "tags": ["state-management", "lightweight", "hooks"]
            },
            {
              "name": "Jotai",
              "description": "React için ilkel ve esnek durum yönetimi çözümü. Atom tabanlı modern yaklaşım ile geliştirici deneyimini iyileştirir. Suspense ve concurrent features ile uyumlu çalışarak React'in en son özelliklerinden faydalanmanızı sağlar.",
              "github": "https://github.com/pmndrs/jotai",
              "demo": "https://jotai.org/",
              "docs": "https://jotai.org/",
              "npm": "jotai",
              "tags": ["state-management", "atoms", "lightweight"]
            }
          ]
        }
      ]
    },
    {
      "id": "development-tools",
      "name": "Development Tools",
      "description": "React geliştirme sürecini hızlandıran, kod kalitesini artıran araçlar ve yardımcılar. Geliştiricilerin daha verimli çalışmasını sağlayan ve uygulama güvenilirliğini artıran profesyonel geliştirme araçları sunar.",
      "subcategories": [
        {
          "id": "testing",
          "name": "Testing",
          "description": "Uygulama güvenilirliğini sağlamak için kapsamlı test kütüphaneleri ve araçları. Geliştiricilerin kod kalitesini artırmasını ve hataları erken tespit etmesini sağlayan güçlü test çözümleri sunar.",
          "libraries": [
            {
              "name": "React Testing Library",
              "description": "İyi test uygulamalarını teşvik eden basit ve kapsamlı test yardımcıları. Erişilebilirlik odaklı yaklaşım ile kullanıcı deneyimini test etmenizi sağlar. React bileşenlerini gerçek kullanım senaryolarına göre test etmek için optimize edilmiştir.",
              "github": "https://github.com/testing-library/react-testing-library",
              "demo": "https://testing-library.com/",
              "docs": "https://testing-library.com/",
              "npm": "@testing-library/react",
              "tags": ["testing", "accessibility", "best-practices"]
            },
            {
              "name": "Jest",
              "description": "Ağrısız JavaScript testi için Facebook tarafından geliştirilen güçlü test framework'ü. Snapshot testing, mocking ve coverage reporting gibi gelişmiş özellikler ile kapsamlı test çözümleri sunar. React uygulamaları için optimize edilmiş performans sağlar.",
              "github": "https://github.com/facebook/jest",
              "demo": "https://jestjs.io/",
              "docs": "https://jestjs.io/",
              "npm": "jest",
              "tags": ["testing", "framework", "facebook"]
            }
          ]
        },
        {
          "id": "linting",
          "name": "Linting & Formatting",
          "description": "Kod kalitesini artırmak ve tutarlılık sağlamak için kod analiz ve formatlama araçları. Geliştiricilerin kod standartlarına uygun yazmasını sağlayan ve proje kalitesini artıran profesyonel araçlar sunar.",
          "libraries": [
            {
              "name": "ESLint",
              "github": "https://github.com/eslint/eslint",
              "demo": "https://eslint.org/",
              "docs": "https://eslint.org/",
              "npm": "eslint",
              "tags": ["linting", "javascript", "code-quality"]
            },
            {
              "name": "Prettier",
              "description": "Görüşlü kod formatlayıcı ile tutarlı kod stili ve otomatik formatlama sağlayın. Geliştirici ekiplerinde kod formatı tartışmalarını sona erdirir ve proje tutarlılığını artırır. Çoklu dil desteği ile farklı proje türlerinde kullanılabilir.",
              "github": "https://github.com/prettier/prettier",
              "demo": "https://prettier.io/",
              "docs": "https://prettier.io/",
              "npm": "prettier",
              "tags": ["formatting", "code-style", "opinionated"]
            }
          ]
        }
      ]
    }
  ],
  "stats": {
    "totalLibraries": 25,
    "totalCategories": 5,
    "totalSubcategories": 12,
    "lastUpdated": "2024-01-20"
  }
}
